Project/Toir/src/InformationRegisters/торо_НормативныеРемонтыОборудования/торо_НормативныеРемонтыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НормативныеРемонтыОборудования</name>
  <resources>
    <name>НормативныйРемонт</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <resources>
    <name>СпособПланирования</name>
    <type>
      <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРемонтныхРабот</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
    <comment>Разрешить сокращать межремонтный период в случае, если начало ремонта приходится на выходной день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПродолжительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьПростоиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтратегияОбслуживания</name>
    <type>
      <types>CatalogRef.торо_СтратегииОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникСтратегии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_НормативныеРемонтыОборудованияУдаленные/торо_НормативныеРемонтыОборудованияУдаленные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НормативныеРемонтыОборудованияУдаленные</name>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ПредшествующиеНормативныеРемонтыОборудования/торо_ПредшествующиеНормативныеРемонтыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПредшествующиеНормативныеРемонтыОборудования</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредшествующийВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ПараметрыЗамещенияПланированияРемонтныхРабот/торо_ПараметрыЗамещенияПланированияРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПараметрыЗамещенияПланированияРемонтныхРабот</name>
  <resources>
    <name>СпособЗамещения</name>
    <type>
      <types>EnumRef.торо_СпособыЗамещенияРемонтов</types>
    </type>
  </resources>
  <resources>
    <name>НачальнаяГраница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонечнаяГраница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗамещаемыйВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_Запчасти/торо_Запчасти.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Запчасти</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>EnumRef.ГрадацииКачества</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_НормыЗапчастейНаОбъектыРемонта/торо_НормыЗапчастейНаОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НормыЗапчастейНаОбъектыРемонта</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ЗапчастиУдаленные/торо_ЗапчастиУдаленные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗапчастиУдаленные</name>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_НормыЗапчастейНаОбъектыРемонтаУдаленные/торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НормыЗапчастейНаОбъектыРемонтаУдаленные</name>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ИзмеряемыеПоказателиОбъектовРемонта/торо_ИзмеряемыеПоказателиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИзмеряемыеПоказателиОбъектовРемонта</name>
  <resources>
    <name>ДопустимыйМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ДопустимыйМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>КритическийМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>КритическийМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <attributes>
    <name>ЗначенияКонтролируемыхПоказателейИзОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗамера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_СтатусыНормативныхРемонтовИТехКарт/торо_СтатусыНормативныхРемонтовИТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыНормативныхРемонтовИТехКарт</name>
  <enumValues>
    <name>ВРазработке</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Редактируется</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/CommonModules/торо_РаботаСНормативамиСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// торо_РаботаСНормативамиСервер: методы, для работы с нормативами
//
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс
// Процедура записывает все нормативы ОР при программном изменении типового ОР.
// При интерактивном изменении, процедуры записи вызываются из формы ОР поотдельности.
// Процедура должна вызываться ДО изменения реквизита ТиповойОР.
//
// Параметры:
//		ТиповойОРСсылка - СправочникСсылка.торо_ТиповыеОР - ссылка на типовой ОР.
//		ОРСсылка - СправочникСсылка.торо_ОбъектыРемонта - ссылка на объект ремонта.
//		ЗаписыватьНормативныеРемонты - Булево - Записывать нормативные ремонты.
//		ЗаписыватьНормативныеЦепочки - Булево - Записывать нормативные цепочки.
//		ЗаписыватьПредшествующиеРемонты - Булево - Записывать предшествующие ремонты.
//		ЗаписыватьЗамещаемыеРемонты - Булево - Записывать замещаемые ремонты.
//		ЗаписыватьКонтролируемыеПоказатели - Булево - Записывать контролируемые показатели.
//		ЗаписыватьНормыЗапчастей - Булево - Записывать нормы запчастей.
//		
Процедура ЗаписатьНормативыОРПриИзмененииТиповогоОР(ТиповойОРСсылка, ОРСсылка,
	ЗаписыватьНормативныеРемонты 		= Истина,
	ЗаписыватьНормативныеЦепочки 		= Истина,
	ЗаписыватьПредшествующиеРемонты 	= Истина,
	ЗаписыватьЗамещаемыеРемонты 		= Истина,
	ЗаписыватьКонтролируемыеПоказатели  = Истина,
	ЗаписыватьНормыЗапчастей 			= Истина) Экспорт
	
	Если ЗаписыватьНормативныеРемонты Тогда
		ЗаписатьНормативыОРПриИзмененииТиповогоОР_НормативныеРемонты(ТиповойОРСсылка, ОРСсылка);
	КонецЕсли;
	
	Если ЗаписыватьНормативныеЦепочки Тогда
		
		// Записываются при записи Типового ОР. Записывать дополнительно нет необходимости.
				
	КонецЕсли;
	
	Если ЗаписыватьПредшествующиеРемонты Тогда
		ЗаписатьНормативыОРПриИзмененииТиповогоОР_ПредшествующиеРемонты(ТиповойОРСсылка, ОРСсылка);
	КонецЕсли;
		
	Если ЗаписыватьЗамещаемыеРемонты Тогда
		ЗаписатьНормативыОРПриИзмененииТиповогоОР_ЗамещаемыеРемонты(ТиповойОРСсылка, ОРСсылка);
	КонецЕсли;
	
	Если ЗаписыватьНормыЗапчастей Тогда
		ЗаписатьНормативыОРПриИзмененииТиповогоОР_НормыЗапчастей(ТиповойОРСсылка, ОРСсылка);
	КонецЕсли;
	
	Если ЗаписыватьКонтролируемыеПоказатели Тогда
		ЗаписатьНормативыОРПриИзмененииТиповогоОР_КонтролируемыеПоказатели(ТиповойОРСсылка, ОРСсылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьНормативыОРПриИзмененииТиповогоОР_НормативныеРемонты(ТиповойОРСсылка, ОРСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ОРссылка КАК ОбъектРемонта,
	|	торо_НормативныеРемонтыОборудования.ВидРемонта КАК ВидРемонта,
	|	торо_НормативныеРемонтыОборудования.Ссылка КАК ТиповойОР,
	|	торо_НормативныеРемонтыОборудования.НормативныйРемонт КАК НормативныйРемонт,
	|	торо_НормативныеРемонтыОборудования.СпособПланирования КАК СпособПланирования,
	|	торо_НормативныеРемонтыОборудования.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот,
	|	торо_НормативныеРемонтыОборудования.СпособВыполнения КАК СпособВыполнения,
	|	торо_НормативныеРемонтыОборудования.НеИспользоватьВПланированииДатуВводаВЭксплуатацию КАК НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
	|	торо_НормативныеРемонтыОборудования.СпособУчетаДатыОтсчета КАК СпособУчетаДатыОтсчета,
	|	торо_НормативныеРемонтыОборудования.НеУчаствуетВПланировании КАК НеУчаствуетВПланировании,
	|	торо_НормативныеРемонтыОборудования.РазрешитьСокращатьМежремонтныйПериодПриПланировании КАК РазрешитьСокращатьМежремонтныйПериодПриПланировании,
	|	торо_НормативныеРемонтыОборудования.НеУчитыватьПриПланированииГрафикРаботыОборудования КАК НеУчитыватьПриПланированииГрафикРаботыОборудования,
	|	торо_НормативныеРемонтыОборудования.НеУчитыватьПриПланированииГрафикРемонтныхРабот КАК НеУчитыватьПриПланированииГрафикРемонтныхРабот,
	|	торо_НормативныеРемонтыОборудования.НеУчитыватьПродолжительность КАК НеУчитыватьПродолжительность,
	|	торо_НормативныеРемонтыОборудования.ИспользоватьКоэффициентыРемонтныхОсобенностей КАК ИспользоватьКоэффициентыРемонтныхОсобенностей,
	|	торо_НормативныеРемонтыОборудования.УчитыватьПростоиОборудования КАК УчитыватьПростоиОборудования,
	|	0 КАК Приоритет,
	|	ЗНАЧЕНИЕ(Справочник.торо_СтратегииОбслуживания.ПустаяСсылка) КАК СтратегияОбслуживания,
	|	"""" КАК ИсточникСтратегии
	|ПОМЕСТИТЬ ТабБазПриоритетов
	|ИЗ
	|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_НормативныеРемонтыОборудования
	|ГДЕ
	|	торо_НормативныеРемонтыОборудования.Ссылка = &НовТиповойОР
	|	И торо_НормативныеРемонтыОборудования.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_НормативныеРемонтыОборудования.ОбъектРемонта,
	|	торо_НормативныеРемонтыОборудования.ВидРемонта,
	|	торо_НормативныеРемонтыОборудования.ТиповойОР,
	|	торо_НормативныеРемонтыОборудования.НормативныйРемонт,
	|	торо_НормативныеРемонтыОборудования.СпособПланирования,
	|	торо_НормативныеРемонтыОборудования.ГрафикРемонтныхРабот,
	|	торо_НормативныеРемонтыОборудования.СпособВыполнения,
	|	торо_НормативныеРемонтыОборудования.НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
	|	торо_НормативныеРемонтыОборудования.СпособУчетаДатыОтсчета,
	|	торо_НормативныеРемонтыОборудования.НеУчаствуетВПланировании,
	|	торо_НормативныеРемонтыОборудования.РазрешитьСокращатьМежремонтныйПериодПриПланировании,
	|	торо_НормативныеРемонтыОборудования.НеУчитыватьПриПланированииГрафикРаботыОборудования,
	|	торо_НормативныеРемонтыОборудования.НеУчитыватьПриПланированииГрафикРемонтныхРабот,
	|	торо_НормативныеРемонтыОборудования.НеУчитыватьПродолжительность,
	|	торо_НормативныеРемонтыОборудования.ИспользоватьКоэффициентыРемонтныхОсобенностей,
	|	торо_НормативныеРемонтыОборудования.УчитыватьПростоиОборудования,
	|	1,
	|	торо_НормативныеРемонтыОборудования.СтратегияОбслуживания,
	|	торо_НормативныеРемонтыОборудования.ИсточникСтратегии
	|ИЗ
	|	РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	|ГДЕ
	|	торо_НормативныеРемонтыОборудования.ОбъектРемонта = &ОРСсылка
	|	И торо_НормативныеРемонтыОборудования.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабБазПриоритетов.ОбъектРемонта КАК ОбъектРемонта,
	|	ТабБазПриоритетов.ВидРемонта КАК ВидРемонта,
	|	МАКСИМУМ(ТабБазПриоритетов.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ТабПриоритетов
	|ИЗ
	|	ТабБазПриоритетов КАК ТабБазПриоритетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабБазПриоритетов.ОбъектРемонта,
	|	ТабБазПриоритетов.ВидРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабБазПриоритетов.ОбъектРемонта КАК ОбъектРемонта,
	|	ТабБазПриоритетов.ВидРемонта КАК ВидРемонта,
	|	ТабБазПриоритетов.ТиповойОР КАК ТиповойОР,
	|	ТабБазПриоритетов.НормативныйРемонт КАК НормативныйРемонт,
	|	ТабБазПриоритетов.СпособПланирования КАК СпособПланирования,
	|	ТабБазПриоритетов.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот,
	|	ТабБазПриоритетов.СпособВыполнения КАК СпособВыполнения,
	|	ТабБазПриоритетов.НеИспользоватьВПланированииДатуВводаВЭксплуатацию КАК НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
	|	ТабБазПриоритетов.СпособУчетаДатыОтсчета КАК СпособУчетаДатыОтсчета,
	|	ТабБазПриоритетов.НеУчаствуетВПланировании КАК НеУчаствуетВПланировании,
	|	ТабБазПриоритетов.РазрешитьСокращатьМежремонтныйПериодПриПланировании КАК РазрешитьСокращатьМежремонтныйПериодПриПланировании,
	|	ТабБазПриоритетов.НеУчитыватьПриПланированииГрафикРаботыОборудования КАК НеУчитыватьПриПланированииГрафикРаботыОборудования,
	|	ТабБазПриоритетов.НеУчитыватьПриПланированииГрафикРемонтныхРабот КАК НеУчитыватьПриПланированииГрафикРемонтныхРабот,
	|	ТабБазПриоритетов.НеУчитыватьПродолжительность КАК НеУчитыватьПродолжительность,
	|	ТабБазПриоритетов.ИспользоватьКоэффициентыРемонтныхОсобенностей КАК ИспользоватьКоэффициентыРемонтныхОсобенностей,
	|	ТабБазПриоритетов.УчитыватьПростоиОборудования КАК УчитыватьПростоиОборудования,
	|	ВЫБОР
	|		КОГДА ТабПриоритетов.Приоритет ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Приоритет,
	|	ТабБазПриоритетов.СтратегияОбслуживания КАК СтратегияОбслуживания,
	|	ТабБазПриоритетов.ИсточникСтратегии КАК ИсточникСтратегии
	|ИЗ
	|	ТабБазПриоритетов КАК ТабБазПриоритетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПриоритетов КАК ТабПриоритетов
	|		ПО ТабБазПриоритетов.ОбъектРемонта = ТабПриоритетов.ОбъектРемонта
	|			И ТабБазПриоритетов.ВидРемонта = ТабПриоритетов.ВидРемонта
	|			И ТабБазПриоритетов.Приоритет = ТабПриоритетов.Приоритет";
	
	Запрос.УстановитьПараметр("НовТиповойОР", ТиповойОРСсылка);
	Запрос.УстановитьПараметр("ОРСсылка",ОРСсылка);
	
	ТаблицаНормативов = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.торо_НормативныеРемонтыОборудования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОРСсылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Загрузить(ТаблицаНормативов);
	НаборЗаписей.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_НормативныеРемонтыОборудованияУдаленные.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НормативныеРемонтыОборудованияУдаленные.ВидРемонта КАК ВидРемонта,
	|	торо_НормативныеРемонтыОборудованияУдаленные.ТиповойОР КАК ТиповойОР
	|ИЗ
	|	РегистрСведений.торо_НормативныеРемонтыОборудованияУдаленные КАК торо_НормативныеРемонтыОборудованияУдаленные
	|ГДЕ
	|	торо_НормативныеРемонтыОборудованияУдаленные.ОбъектРемонта = &ОРСсылка
	|	И торо_НормативныеРемонтыОборудованияУдаленные.ТиповойОР = &НовТиповойОР";
	
	Запрос.УстановитьПараметр("НовТиповойОР", ТиповойОРСсылка);
	Запрос.УстановитьПараметр("ОРСсылка",ОРСсылка);
	ТаблицаНормативовУдаленные = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.торо_НормативныеРемонтыОборудованияУдаленные.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОРСсылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Загрузить(ТаблицаНормативовУдаленные);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаписатьНормативыОРПриИзмененииТиповогоОР_ПредшествующиеРемонты(ТиповойОРСсылка, ОРСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_НормативныеРемонтыОборудования.ВидРемонта,
	|	торо_НормативныеРемонтыОборудования.Ссылка
	|ПОМЕСТИТЬ ДействующиеВР
	|ИЗ
	|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_НормативныеРемонтыОборудования
	|ГДЕ
	|	торо_НормативныеРемонтыОборудования.Ссылка = &НовТиповойОР
	|	И торо_НормативныеРемонтыОборудования.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ТиповыеОРПредшествующиеРемонты.ВидРемонта,
	|	&ОРСсылка КАК ОбъектРемонта,
	|	торо_ТиповыеОРПредшествующиеРемонты.ПредшествующийВидРемонта,
	|	торо_ТиповыеОРПредшествующиеРемонты.Ссылка КАК ТиповойОР,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ ТабБазПриоритетов
	|ИЗ
	|	ДействующиеВР КАК торо_ТиповыеОРНормативныеРемонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ПредшествующиеРемонты КАК торо_ТиповыеОРПредшествующиеРемонты
	|		ПО торо_ТиповыеОРНормативныеРемонты.Ссылка = торо_ТиповыеОРПредшествующиеРемонты.Ссылка
	|			И торо_ТиповыеОРНормативныеРемонты.ВидРемонта = торо_ТиповыеОРПредшествующиеРемонты.ВидРемонта
	|			И (торо_ТиповыеОРПредшествующиеРемонты.ПредшествующийВидРемонта В
	|				(ВЫБРАТЬ
	|					ДействующиеВР.ВидРемонта
	|				ИЗ
	|					ДействующиеВР КАК ДействующиеВР))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ПредшествующиеНормативныеРемонтыОборудования.ВидРемонта,
	|	торо_ПредшествующиеНормативныеРемонтыОборудования.ОбъектРемонта,
	|	торо_ПредшествующиеНормативныеРемонтыОборудования.ПредшествующийВидРемонта,
	|	торо_ПредшествующиеНормативныеРемонтыОборудования.ТиповойОР,
	|	1
	|ИЗ
	|	РегистрСведений.торо_ПредшествующиеНормативныеРемонтыОборудования КАК торо_ПредшествующиеНормативныеРемонтыОборудования
	|ГДЕ
	|	торо_ПредшествующиеНормативныеРемонтыОборудования.ОбъектРемонта = &ОРСсылка
	|	И торо_ПредшествующиеНормативныеРемонтыОборудования.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабБазПриоритетов.ВидРемонта,
	|	ТабБазПриоритетов.ОбъектРемонта,
	|	МАКСИМУМ(ТабБазПриоритетов.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ТабПриоритетов
	|ИЗ
	|	ТабБазПриоритетов КАК ТабБазПриоритетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабБазПриоритетов.ВидРемонта,
	|	ТабБазПриоритетов.ОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабБазПриоритетов.ВидРемонта,
	|	ТабБазПриоритетов.ОбъектРемонта,
	|	ТабБазПриоритетов.ПредшествующийВидРемонта,
	|	ТабБазПриоритетов.ТиповойОР,
	|	ВЫБОР
	|		КОГДА ТабПриоритетов.Приоритет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	ТабБазПриоритетов КАК ТабБазПриоритетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПриоритетов КАК ТабПриоритетов
	|		ПО ТабБазПриоритетов.ОбъектРемонта = ТабПриоритетов.ОбъектРемонта
	|			И ТабБазПриоритетов.ВидРемонта = ТабПриоритетов.ВидРемонта
	|			И ТабБазПриоритетов.Приоритет = ТабПриоритетов.Приоритет";
	
	Запрос.УстановитьПараметр("НовТиповойОР", ТиповойОРСсылка);
	Запрос.УстановитьПараметр("ОРСсылка",ОРСсылка);
	Запрос.УстановитьПараметр("ТекТиповойОР",ОРСсылка.ТиповойОР);
	
	ТаблицаПредшествующих = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.торо_ПредшествующиеНормативныеРемонтыОборудования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОРСсылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Загрузить(ТаблицаПредшествующих);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаписатьНормативыОРПриИзмененииТиповогоОР_ЗамещаемыеРемонты(ТиповойОРСсылка, ОРСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_НормативныеРемонтыОборудования.ВидРемонта КАК ВидРемонта,
	|	торо_НормативныеРемонтыОборудования.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДействующиеВР
	|ИЗ
	|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_НормативныеРемонтыОборудования
	|ГДЕ
	|	торо_НормативныеРемонтыОборудования.Ссылка = &НовТиповойОР
	|	И торо_НормативныеРемонтыОборудования.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ТиповыеОРЗамещаемыеРемонты.ВидРемонта КАК ВидРемонта,
	|	&ОРСсылка КАК ОбъектРемонта,
	|	торо_ТиповыеОРЗамещаемыеРемонты.ЗамещаемыйВидРемонта КАК ЗамещаемыйВидРемонта,
	|	торо_ТиповыеОРЗамещаемыеРемонты.Ссылка КАК ТиповойОР,
	|	торо_ТиповыеОРЗамещаемыеРемонты.СпособЗамещения КАК СпособЗамещения,
	|	торо_ТиповыеОРЗамещаемыеРемонты.НачальнаяГраница КАК НачальнаяГраница,
	|	торо_ТиповыеОРЗамещаемыеРемонты.КонечнаяГраница КАК КонечнаяГраница,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ ТабБазПриоритетов
	|ИЗ
	|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ЗамещаемыеРемонты КАК торо_ТиповыеОРЗамещаемыеРемонты
	|		ПО (торо_ТиповыеОРНормативныеРемонты.Ссылка = &НовТиповойОР)
	|			И торо_ТиповыеОРНормативныеРемонты.Ссылка = торо_ТиповыеОРЗамещаемыеРемонты.Ссылка
	|			И торо_ТиповыеОРНормативныеРемонты.ВидРемонта = торо_ТиповыеОРЗамещаемыеРемонты.ВидРемонта
	|			И (торо_ТиповыеОРЗамещаемыеРемонты.ЗамещаемыйВидРемонта В
	|				(ВЫБРАТЬ
	|					ДействующиеВР.ВидРемонта
	|				ИЗ
	|					ДействующиеВР КАК ДействующиеВР))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ВидРемонта,
	|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ОбъектРемонта,
	|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ЗамещаемыйВидРемонта,
	|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ТиповойОР,
	|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СпособЗамещения,
	|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.НачальнаяГраница,
	|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.КонечнаяГраница,
	|	1
	|ИЗ
	|	РегистрСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот КАК торо_ПараметрыЗамещенияПланированияРемонтныхРабот
	|ГДЕ
	|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ОбъектРемонта = &ОРСсылка
	|	И торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабБазПриоритетов.ВидРемонта КАК ВидРемонта,
	|	ТабБазПриоритетов.ОбъектРемонта КАК ОбъектРемонта,
	|	МАКСИМУМ(ТабБазПриоритетов.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ТабПриоритетов
	|ИЗ
	|	ТабБазПриоритетов КАК ТабБазПриоритетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабБазПриоритетов.ВидРемонта,
	|	ТабБазПриоритетов.ОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабБазПриоритетов.ВидРемонта КАК ВидРемонта,
	|	ТабБазПриоритетов.ОбъектРемонта КАК ОбъектРемонта,
	|	ТабБазПриоритетов.ЗамещаемыйВидРемонта КАК ЗамещаемыйВидРемонта,
	|	ТабБазПриоритетов.ТиповойОР КАК ТиповойОР,
	|	ТабБазПриоритетов.СпособЗамещения КАК СпособЗамещения,
	|	ТабБазПриоритетов.НачальнаяГраница КАК НачальнаяГраница,
	|	ТабБазПриоритетов.КонечнаяГраница КАК КонечнаяГраница,
	|	ВЫБОР
	|		КОГДА ТабПриоритетов.Приоритет ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	ТабБазПриоритетов КАК ТабБазПриоритетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПриоритетов КАК ТабПриоритетов
	|		ПО ТабБазПриоритетов.ОбъектРемонта = ТабПриоритетов.ОбъектРемонта
	|			И ТабБазПриоритетов.ВидРемонта = ТабПриоритетов.ВидРемонта
	|			И ТабБазПриоритетов.Приоритет = ТабПриоритетов.Приоритет";
	
	Запрос.УстановитьПараметр("НовТиповойОР", ТиповойОРСсылка);
	Запрос.УстановитьПараметр("ОРСсылка",ОРСсылка);
	Запрос.УстановитьПараметр("ТекТиповойОР",ОРСсылка.ТиповойОР);
	
	ТаблицаЗамещаемых = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОРСсылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Загрузить(ТаблицаЗамещаемых);
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура ЗаписатьНормативыОРПриИзмененииТиповогоОР_НормыЗапчастей(ТиповойОРСсылка, ОРСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ТиповыеОРЗапчасти.Номенклатура КАК Номенклатура,
	|	торо_ТиповыеОРЗапчасти.Количество КАК Количество,
	|	торо_ТиповыеОРЗапчасти.Характеристика КАК Характеристика,
	|	торо_ТиповыеОРЗапчасти.Качество КАК Качество
	|ПОМЕСТИТЬ ВТ_ЗапчастиТОР
	|ИЗ
	|	Справочник.торо_ТиповыеОР.Запчасти КАК торо_ТиповыеОРЗапчасти
	|ГДЕ
	|	торо_ТиповыеОРЗапчасти.Ссылка = &ТОР
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Качество,
	|	Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_Запчасти.Номенклатура КАК Номенклатура,
	|	торо_Запчасти.Качество КАК Качество,
	|	торо_Запчасти.Характеристика КАК Характеристика,
	|	торо_Запчасти.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ЗапчастиОР
	|ИЗ
	|	РегистрСведений.торо_Запчасти КАК торо_Запчасти
	|ГДЕ
	|	торо_Запчасти.ОбъектРемонта = &ОбъектРемонта
	|	И торо_Запчасти.ТиповойОР = &ПустойТОР
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Качество,
	|	Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ТиповыеОРНормативныеЗатратыПриТОиР.Характеристика КАК Характеристика,
	|	торо_ТиповыеОРНормативныеЗатратыПриТОиР.Номенклатура КАК Номенклатура,
	|	торо_ТиповыеОРНормативныеЗатратыПриТОиР.ВидРемонта КАК ВидРемонта,
	|	торо_ТиповыеОРНормативныеЗатратыПриТОиР.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_НормЗатратыТОР
	|ИЗ
	|	Справочник.торо_ТиповыеОР.НормативныеЗатратыПриТОиР КАК торо_ТиповыеОРНормативныеЗатратыПриТОиР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
	|		ПО (торо_ТиповыеОРНормативныеЗатратыПриТОиР.Ссылка = &ТОР)
	|			И (торо_ТиповыеОРНормативныеРемонты.Ссылка = &ТОР)
	|			И торо_ТиповыеОРНормативныеЗатратыПриТОиР.ВидРемонта = торо_ТиповыеОРНормативныеРемонты.ВидРемонта
	|			И (торо_ТиповыеОРНормативныеРемонты.Статус = &СтатусДействует)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	ВидРемонта,
	|	Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура КАК Номенклатура,
	|	торо_НормыЗапчастейНаОбъектыРемонта.ВидРемонта КАК ВидРемонта,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Характеристика КАК Характеристика,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_НормыОР
	|ИЗ
	|	РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонта КАК торо_НормыЗапчастейНаОбъектыРемонта
	|ГДЕ
	|	торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта = &ОбъектРемонта
	|	И торо_НормыЗапчастейНаОбъектыРемонта.ТиповойОР = &ПустойТОР
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	ВидРемонта,
	|	Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ЗапчастиОР.Номенклатура, ВТ_ЗапчастиТОР.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_ЗапчастиОР.Характеристика, ВТ_ЗапчастиТОР.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ВТ_ЗапчастиОР.Качество, ВТ_ЗапчастиТОР.Качество) КАК Качество,
	|	ЕСТЬNULL(ВТ_ЗапчастиОР.Количество, ВТ_ЗапчастиТОР.Количество) КАК Количество,
	|	ВЫБОР
	|		КОГДА ВТ_ЗапчастиТОР.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоТиповой,
	|	ВЫБОР
	|		КОГДА торо_ЗапчастиУдаленные.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Удален
	|ПОМЕСТИТЬ ВТ_ЗапчастиТОРиОР
	|ИЗ
	|	ВТ_ЗапчастиТОР КАК ВТ_ЗапчастиТОР
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ЗапчастиОР КАК ВТ_ЗапчастиОР
	|		ПО ВТ_ЗапчастиТОР.Номенклатура = ВТ_ЗапчастиОР.Номенклатура
	|			И ВТ_ЗапчастиТОР.Характеристика = ВТ_ЗапчастиОР.Характеристика
	|			И ВТ_ЗапчастиТОР.Качество = ВТ_ЗапчастиОР.Качество
	|			И ВТ_ЗапчастиТОР.Количество = ВТ_ЗапчастиОР.Количество
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗапчастиУдаленные КАК торо_ЗапчастиУдаленные
	|		ПО (торо_ЗапчастиУдаленные.ОбъектРемонта = &ОбъектРемонта)
	|			И ВТ_ЗапчастиТОР.Номенклатура = торо_ЗапчастиУдаленные.Номенклатура
	|			И ВТ_ЗапчастиТОР.Характеристика = торо_ЗапчастиУдаленные.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗапчастиТОРиОР.Номенклатура КАК Номенклатура,
	|	ВТ_ЗапчастиТОРиОР.Характеристика КАК Характеристика,
	|	ВТ_ЗапчастиТОРиОР.Качество КАК Качество,
	|	ВТ_ЗапчастиТОРиОР.Количество КАК Количество,
	|	ВТ_ЗапчастиТОРиОР.ЭтоТиповой КАК ЭтоТиповой,
	|	ВТ_ЗапчастиТОРиОР.Удален КАК Удален
	|ПОМЕСТИТЬ ВТ_Запачати_Промежуточная
	|ИЗ
	|	ВТ_ЗапчастиТОРиОР КАК ВТ_ЗапчастиТОРиОР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Запачати_Промежуточная.Номенклатура КАК Номенклатура,
	|	ВТ_Запачати_Промежуточная.Характеристика КАК Характеристика,
	|	СУММА(1) КАК КоличествоСтрок
	|ПОМЕСТИТЬ ВТ_Запчасти_Дубли
	|ИЗ
	|	ВТ_Запачати_Промежуточная КАК ВТ_Запачати_Промежуточная
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Запачати_Промежуточная.Номенклатура,
	|	ВТ_Запачати_Промежуточная.Характеристика
	|
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Запачати_Промежуточная.Номенклатура КАК Номенклатура,
	|	ВТ_Запачати_Промежуточная.Характеристика КАК Характеристика,
	|	ВТ_Запачати_Промежуточная.Качество КАК Качество,
	|	ВТ_Запачати_Промежуточная.Количество КАК Количество,
	|	ВТ_Запачати_Промежуточная.ЭтоТиповой КАК ЭтоТиповой,
	|	ВЫБОР
	|		КОГДА ВТ_Запчасти_Дубли.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВТ_Запачати_Промежуточная.Удален
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Удален
	|ПОМЕСТИТЬ ВТ_Запчасти_БезВР
	|ИЗ
	|	ВТ_Запачати_Промежуточная КАК ВТ_Запачати_Промежуточная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Запчасти_Дубли КАК ВТ_Запчасти_Дубли
	|		ПО ВТ_Запачати_Промежуточная.Номенклатура = ВТ_Запчасти_Дубли.Номенклатура
	|			И ВТ_Запачати_Промежуточная.Характеристика = ВТ_Запчасти_Дубли.Характеристика
	|			И (ВТ_Запачати_Промежуточная.ЭтоТиповой)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_НормыОР.Номенклатура, ВТ_НормЗатратыТОР.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_НормыОР.ВидРемонта, ВТ_НормЗатратыТОР.ВидРемонта) КАК ВидРемонта,
	|	ЕСТЬNULL(ВТ_НормыОР.Характеристика, ВТ_НормЗатратыТОР.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ВТ_НормыОР.Количество, ВТ_НормЗатратыТОР.Количество) КАК Количество,
	|	ВЫБОР
	|		КОГДА ВТ_НормЗатратыТОР.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоТиповой,
	|	ВЫБОР
	|		КОГДА торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Удален
	|ПОМЕСТИТЬ ВТ_нормЗатратыТОРиОР
	|ИЗ
	|	ВТ_НормЗатратыТОР КАК ВТ_НормЗатратыТОР
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_НормыОР КАК ВТ_НормыОР
	|		ПО ВТ_НормЗатратыТОР.Номенклатура = ВТ_НормыОР.Номенклатура
	|			И ВТ_НормЗатратыТОР.Характеристика = ВТ_НормыОР.Характеристика
	|			И ВТ_НормЗатратыТОР.ВидРемонта = ВТ_НормыОР.ВидРемонта
	|			И ВТ_НормЗатратыТОР.Количество = ВТ_НормыОР.Количество
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонтаУдаленные КАК торо_НормыЗапчастейНаОбъектыРемонтаУдаленные
	|		ПО (торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.ОбъектРемонта = &ОбъектРемонта)
	|			И ВТ_НормЗатратыТОР.Номенклатура = торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.Номенклатура
	|			И ВТ_НормЗатратыТОР.Характеристика = торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.Характеристика
	|			И ВТ_НормЗатратыТОР.ВидРемонта = торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.ВидРемонта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_нормЗатратыТОРиОР.Номенклатура КАК Номенклатура,
	|	ВТ_нормЗатратыТОРиОР.ВидРемонта КАК ВидРемонта,
	|	ВТ_нормЗатратыТОРиОР.Характеристика КАК Характеристика,
	|	СУММА(1) КАК КоличествоСтрок
	|ПОМЕСТИТЬ ВТ_ДублиВР
	|ИЗ
	|	ВТ_нормЗатратыТОРиОР КАК ВТ_нормЗатратыТОРиОР
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_нормЗатратыТОРиОР.Номенклатура,
	|	ВТ_нормЗатратыТОРиОР.ВидРемонта,
	|	ВТ_нормЗатратыТОРиОР.Характеристика
	|
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_нормЗатратыТОРиОР.Номенклатура КАК Номенклатура,
	|	ВТ_нормЗатратыТОРиОР.ВидРемонта КАК ВидРемонта,
	|	ВТ_нормЗатратыТОРиОР.Характеристика КАК Характеристика,
	|	ВТ_нормЗатратыТОРиОР.Количество КАК Количество,
	|	ВТ_нормЗатратыТОРиОР.ЭтоТиповой КАК ЭтоТиповой,
	|	ВЫБОР
	|		КОГДА ВТ_ДублиВР.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВТ_нормЗатратыТОРиОР.Удален
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Удален
	|ПОМЕСТИТЬ ВТ_ВР_Финальная
	|ИЗ
	|	ВТ_нормЗатратыТОРиОР КАК ВТ_нормЗатратыТОРиОР
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДублиВР КАК ВТ_ДублиВР
	|		ПО ВТ_нормЗатратыТОРиОР.Номенклатура = ВТ_ДублиВР.Номенклатура
	|			И ВТ_нормЗатратыТОРиОР.ВидРемонта = ВТ_ДублиВР.ВидРемонта
	|			И ВТ_нормЗатратыТОРиОР.Характеристика = ВТ_ДублиВР.Характеристика
	|			И (ВТ_нормЗатратыТОРиОР.ЭтоТиповой)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_Запчасти_БезВР.Номенклатура, ВТ_ВР_Финальная.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_Запчасти_БезВР.Характеристика, ВТ_ВР_Финальная.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ВТ_Запчасти_БезВР.Качество, &ПустоеКачество) КАК Качество,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_Запчасти_БезВР.Количество, ВТ_ВР_Финальная.Количество)) КАК Количество,
	|	ЕСТЬNULL(ВТ_Запчасти_БезВР.ЭтоТиповой, ЛОЖЬ) КАК ЭтоТиповой,
	|	ЕСТЬNULL(ВТ_Запчасти_БезВР.Удален, ЛОЖЬ) КАК Удален,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_ВР_Финальная.Количество, 0)) КАК КоличествоДляПроверки
	|ИЗ
	|	ВТ_Запчасти_БезВР КАК ВТ_Запчасти_БезВР
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ВР_Финальная КАК ВТ_ВР_Финальная
	|		ПО ВТ_Запчасти_БезВР.Номенклатура = ВТ_ВР_Финальная.Номенклатура
	|			И ВТ_Запчасти_БезВР.Характеристика = ВТ_ВР_Финальная.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТ_Запчасти_БезВР.Номенклатура, ВТ_ВР_Финальная.Номенклатура),
	|	ЕСТЬNULL(ВТ_Запчасти_БезВР.Характеристика, ВТ_ВР_Финальная.Характеристика),
	|	ЕСТЬNULL(ВТ_Запчасти_БезВР.Качество, &ПустоеКачество),
	|	ЕСТЬNULL(ВТ_Запчасти_БезВР.ЭтоТиповой, ЛОЖЬ),
	|	ЕСТЬNULL(ВТ_Запчасти_БезВР.Удален, ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВР_Финальная.Номенклатура КАК Номенклатура,
	|	ВТ_ВР_Финальная.ВидРемонта КАК ВидРемонта,
	|	ВТ_ВР_Финальная.Характеристика КАК Характеристика,
	|	ВТ_ВР_Финальная.Количество КАК Количество,
	|	ВТ_ВР_Финальная.ЭтоТиповой КАК ЭтоТиповой,
	|	ВТ_ВР_Финальная.Удален КАК Удален
	|ИЗ
	|	ВТ_ВР_Финальная КАК ВТ_ВР_Финальная";
	
	Запрос.УстановитьПараметр("ТОР", ТиповойОРСсылка);
	Запрос.УстановитьПараметр("ОбъектРемонта", ОРСсылка);
	Запрос.УстановитьПараметр("ПустойТОР", Справочники.торо_ТиповыеОР.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтатусДействует", Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.Действует);
	Запрос.УстановитьПараметр("ПустоеКачество", Перечисления.ГрадацииКачества.ПустаяСсылка());
	
	Результат = Запрос.ВыполнитьПакет();
	
	СтруктураНормативовЗапчастей = Новый Структура;
	СтруктураНормативовЗапчастей.Вставить("Запчасти", Результат[11].Выбрать());
	СтруктураНормативовЗапчастей.Вставить("НормативныеЗатраты", Результат[12].Выбрать());
	
	МасОшибок = Новый Массив;
	Отказ = Ложь;

	// Запись запчастей
	НаборЗаписей = РегистрыСведений.торо_Запчасти.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОРСсылка);
	
	НаборЗаписейУдаленные = РегистрыСведений.торо_ЗапчастиУдаленные.СоздатьНаборЗаписей();
	НаборЗаписейУдаленные.Отбор.ОбъектРемонта.Установить(ОРСсылка);
	
	ВыборкаЗапчасти = СтруктураНормативовЗапчастей.Запчасти;
	Пока ВыборкаЗапчасти.Следующий() Цикл
		
		Если ВыборкаЗапчасти.Количество < ВыборкаЗапчасти.КоличествоДляПроверки Тогда
			ШаблонСообщения = НСтр("es='En el objeto de la reparación %1 cantidad de los gastos normativos por la nomenclatura ""%2"" supera la cantidad de la nomenclatura. ¡La anotación de las normas de las partes de recambio era anulada!';ru='В объекте ремонта %1 количество нормативных затрат по номенклатуре ""%2"" превышает количество номенклатуры. Запись нормативов запчастей была отменена!';en='In repair object%1, the number of standard costs for item ""%2"" exceeds the number of items. Record of parts specifications has been canceled!'");
			МасОшибок.Добавить(СтрШаблон(ШаблонСообщения, ОРСсылка, ВыборкаЗапчасти.Номенклатура));
		КонецЕсли;
		
		нс = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(нс, ВыборкаЗапчасти);
		нс.ОбъектРемонта = ОРСсылка;
		нс.Приоритет = Истина;
		
		Если ВыборкаЗапчасти.ЭтоТиповой Тогда
			нс.ТиповойОР = ТиповойОРСсылка;
		КонецЕсли;
		
		Если ВыборкаЗапчасти.Удален Тогда
			нс.Приоритет = Ложь;
			нс.ТиповойОР = ТиповойОРСсылка;
			
			нсу = НаборЗаписейУдаленные.Добавить();
			ЗаполнитьЗначенияСвойств(нсу, ВыборкаЗапчасти);
			нсу.ОбъектРемонта = ОРСсылка;
			нсу.ТиповойОР = ТиповойОРСсылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого текОшибка из масОшибок Цикл
		ОбщегоНазначения.СообщитьПользователю(текОшибка,,,, Отказ);
	КонецЦикла;
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;
		
	НаборЗаписей.Записать();			
	НаборЗаписейУдаленные.Записать();
	
	
	// Запись норм запчастей по видам ремонта.
	ВыборкаНормы = СтруктураНормативовЗапчастей.НормативныеЗатраты;
	
	НаборЗаписей = РегистрыСведений.торо_НормыЗапчастейНаОбъектыРемонта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОРСсылка);
	
	НаборЗаписейУдаленные = РегистрыСведений.торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.СоздатьНаборЗаписей();
	НаборЗаписейУдаленные.Отбор.ОбъектРемонта.Установить(ОРСсылка);
	
	Пока ВыборкаНормы.Следующий() Цикл
		
		нс = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(нс, ВыборкаНормы);
		нс.ОбъектРемонта = ОРСсылка;
		нс.Приоритет = Истина;
		
		Если ВыборкаНормы.ЭтоТиповой Тогда
			нс.ТиповойОР = ТиповойОРСсылка;
		КонецЕсли;
		
		Если ВыборкаНормы.Удален Тогда
			нс.Приоритет = Ложь;
			нс.ТиповойОР = ТиповойОРСсылка;
			
			нсу = НаборЗаписейУдаленные.Добавить();
			ЗаполнитьЗначенияСвойств(нсу, ВыборкаНормы);
			нсу.ОбъектРемонта = ОРСсылка;
			нсу.ТиповойОР = ТиповойОРСсылка;
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();			
	НаборЗаписейУдаленные.Записать();
	
КонецПроцедуры

Процедура ЗаписатьНормативыОРПриИзмененииТиповогоОР_КонтролируемыеПоказатели(ТиповойОРСсылка, ОРСсылка)
	
	// Удалим неиспользуемые показатели, оставшиеся от прошлого типового.
	Если НЕ ЗначениеЗаполнено(ТиповойОРСсылка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель
		|ИЗ
		|	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
		|ГДЕ
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта = &ОРСсылка
		|	И торо_ИзмеряемыеПоказателиОбъектовРемонта.Удален";
		Запрос.УстановитьПараметр("ОРСсылка",ОРСсылка);
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				МенеджерЗаписи = РегистрыСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.ОбъектРемонта = ОРСсылка;
				МенеджерЗаписи.Показатель = Выборка.Показатель;
				МенеджерЗаписи.Прочитать();
				МенеджерЗаписи.Удалить();
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
